retu2libc/capstone/arch/TMS320C67x/TMS320C67xMapping.c
		TMS320C67x_SUBAW_d1_rir, TMS320C67X_INS_SUBAW,
#ifndef CAPSTONE_DIET
		{ 0 }, { 0 }, { TMS320C67X_GRP_FUNIT_D, 0 }, 0, 0
#endif
	},
	{
		TMS320C67x_SUBAW_d1_rrr, TMS320C67X_INS_SUBAW,
#ifndef CAPSTONE_DIET
		{ 0 }, { 0 }, { TMS320C67X_GRP_FUNIT_D, 0 }, 0, 0
#endif
	},
	{
		TMS320C67x_SUBC_l1_rrr_x2, TMS320C67X_INS_SUBC,
#ifndef CAPSTONE_DIET
		{ 0 }, { 0 }, { TMS320C67X_GRP_FUNIT_L, 0 }, 0, 0
#endif
	},
	{
		TMS320C67x_SUBU_l1_rrp_x1, TMS320C67X_INS_SUBU,
#ifndef CAPSTONE_DIET
		{ 0 }, { 0 }, { TMS320C67X_GRP_FUNIT_L, 0 }, 0, 0
#endif
	},
	{
		TMS320C67x_SUBU_l1_rrp_x2, TMS320C67X_INS_SUBU,
#ifndef CAPSTONE_DIET
		{ 0 }, { 0 }, { TMS320C67X_GRP_FUNIT_L, 0 }, 0, 0
#endif
	},
	{
		TMS320C67x_SUB_d1_rir, TMS320C67X_INS_SUB,
#ifndef CAPSTONE_DIET
		{ 0 }, { 0 }, { TMS320C67X_GRP_FUNIT_D, 0 }, 0, 0
#endif
	},
	{
		TMS320C67x_SUB_d1_rrr, TMS320C67X_INS_SUB,
#ifndef CAPSTONE_DIET
		{ 0 }, { 0 }, { TMS320C67X_GRP_FUNIT_D, 0 }, 0, 0
#endif
	},
	{
		TMS320C67x_SUB_d2_rrr, TMS320C67X_INS_SUB,
#ifndef CAPSTONE_DIET
		{ 0 }, { 0 }, { TMS320C67X_GRP_FUNIT_D, 0 }, 0, 0
#endif
	},
	{
		TMS320C67x_SUB_l1_ipp, TMS320C67X_INS_SUB,
#ifndef CAPSTONE_DIET
		{ 0 }, { 0 }, { TMS320C67X_GRP_FUNIT_L, 0 }, 0, 0
#endif
	},
	{
		TMS320C67x_SUB_l1_irr, TMS320C67X_INS_SUB,
#ifndef CAPSTONE_DIET
		{ 0 }, { 0 }, { TMS320C67X_GRP_FUNIT_L, 0 }, 0, 0
#endif
	},
	{
		TMS320C67x_SUB_l1_rrp_x1, TMS320C67X_INS_SUB,
#ifndef CAPSTONE_DIET
		{ 0 }, { 0 }, { TMS320C67X_GRP_FUNIT_L, 0 }, 0, 0
#endif
	},
	{
		TMS320C67x_SUB_l1_rrp_x2, TMS320C67X_INS_SUB,
#ifndef CAPSTONE_DIET
		{ 0 }, { 0 }, { TMS320C67X_GRP_FUNIT_L, 0 }, 0, 0
#endif
	},
	{
		TMS320C67x_SUB_l1_rrr_x1, TMS320C67X_INS_SUB,
#ifndef CAPSTONE_DIET
		{ 0 }, { 0 }, { TMS320C67X_GRP_FUNIT_L, 0 }, 0, 0
#endif
	},
	{
		TMS320C67x_SUB_l1_rrr_x2, TMS320C67X_INS_SUB,
#ifndef CAPSTONE_DIET
		{ 0 }, { 0 }, { TMS320C67X_GRP_FUNIT_L, 0 }, 0, 0
#endif
	},
	{
		TMS320C67x_SUB_s1_irr, TMS320C67X_INS_SUB,
#ifndef CAPSTONE_DIET
		{ 0 }, { 0 }, { TMS320C67X_GRP_FUNIT_S, 0 }, 0, 0
#endif
	},
	{
		TMS320C67x_SUB_s1_rrr, TMS320C67X_INS_SUB,
#ifndef CAPSTONE_DIET
		{ 0 }, { 0 }, { TMS320C67X_GRP_FUNIT_S, 0 }, 0, 0
#endif
	},
	{
		TMS320C67x_SUB_s4_rrr, TMS320C67X_INS_SUB,
#ifndef CAPSTONE_DIET
		{ 0 }, { 0 }, { TMS320C67X_GRP_FUNIT_S, 0 }, 0, 0
#endif
	},
	{
		TMS320C67x_XOR_d2_rir, TMS320C67X_INS_XOR,
#ifndef CAPSTONE_DIET
		{ 0 }, { 0 }, { TMS320C67X_GRP_FUNIT_D, 0 }, 0, 0
#endif
	},
	{
		TMS320C67x_XOR_d2_rrr, TMS320C67X_INS_XOR,
#ifndef CAPSTONE_DIET
		{ 0 }, { 0 }, { TMS320C67X_GRP_FUNIT_D, 0 }, 0, 0
#endif
	},
	{
		TMS320C67x_XOR_l1_irr, TMS320C67X_INS_XOR,
#ifndef CAPSTONE_DIET
		{ 0 }, { 0 }, { TMS320C67X_GRP_FUNIT_L, 0 }, 0, 0
#endif
	},
	{
		TMS320C67x_XOR_l1_rrr_x2, TMS320C67X_INS_XOR,
#ifndef CAPSTONE_DIET
		{ 0 }, { 0 }, { TMS320C67X_GRP_FUNIT_L, 0 }, 0, 0
#endif
	},
	{
		TMS320C67x_XOR_s1_irr, TMS320C67X_INS_XOR,
#ifndef CAPSTONE_DIET
		{ 0 }, { 0 }, { TMS320C67X_GRP_FUNIT_S, 0 }, 0, 0
#endif
	},
	{
		TMS320C67x_XOR_s1_rrr, TMS320C67X_INS_XOR,
#ifndef CAPSTONE_DIET
		{ 0 }, { 0 }, { TMS320C67X_GRP_FUNIT_S, 0 }, 0, 0
#endif
	},
};

void TMS320C67x_get_insn_id(cs_struct *h, cs_insn *insn, unsigned int id)
{
	unsigned short i;

	i = insn_find(insns, ARR_SIZE(insns), id, &h->insn_cache);
	if (i != 0) {
		insn->id = insns[i].mapid;

		if (h->detail_opt) {
#ifndef CAPSTONE_DIET
			memcpy(insn->detail->regs_read, insns[i].regs_use, sizeof(insns[i].regs_use));
			insn->detail->regs_read_count = (uint8_t)count_positive(insns[i].regs_use);

			memcpy(insn->detail->regs_write, insns[i].regs_mod, sizeof(insns[i].regs_mod));
			insn->detail->regs_write_count = (uint8_t)count_positive(insns[i].regs_mod);

			memcpy(insn->detail->groups, insns[i].groups, sizeof(insns[i].groups));
			insn->detail->groups_count = (uint8_t)count_positive8(insns[i].groups);

			if (insns[i].branch || insns[i].indirect_branch) {
				insn->detail->groups[insn->detail->groups_count] = TMS320C67X_GRP_JUMP;
				insn->detail->groups_count++;
			}
#endif
		}
	}
}

#ifndef CAPSTONE_DIET
//grep TMS320C67X_INS include/capstone/tms320C67x.h | awk '{print "{"$1 "\""tolower(substr($1, 16, length($1)-16))"\"""},"}'
static const name_map insn_name_maps[] = {
    {TMS320C67X_INS_INVALID, NULL},
    {TMS320C67X_INS_ABS, "abs"},
    {TMS320C67X_INS_ABSDP, "absdp"},
    {TMS320C67X_INS_ABSSP, "abssp"},
    {TMS320C67X_INS_ADD, "add"},
    {TMS320C67X_INS_ADDAB, "addab"},
    {TMS320C67X_INS_ADD2, "add2"},
    {TMS320C67X_INS_ADD4, "add4"},
    {TMS320C67X_INS_ADDAD, "addad"},
    {TMS320C67X_INS_ADDAH, "addah"},
    {TMS320C67X_INS_ADDAW, "addaw"},
    {TMS320C67X_INS_ADDDP, "adddp"},
    {TMS320C67X_INS_ADDK, "addk"},
    {TMS320C67X_INS_ADDSP, "addsp"},
    {TMS320C67X_INS_ADDU, "addu"},
    {TMS320C67X_INS_ADDU2, "addu2"},
    {TMS320C67X_INS_AND, "and"},
    {TMS320C67X_INS_B, "b"},
    {TMS320C67X_INS_CLR, "clr"},
    {TMS320C67X_INS_CMPEQ, "cmpeq"},
    {TMS320C67X_INS_CMPEQDP, "cmpeqdp"},
    {TMS320C67X_INS_CMPEQSP, "cmpeqsp"},
    {TMS320C67X_INS_CMPGT, "cmpgt"},
    {TMS320C67X_INS_CMPGTDP, "cmpgtdp"},
    {TMS320C67X_INS_CMPGTSP, "cmpgtsp"},
    {TMS320C67X_INS_CMPGTU, "cmpgtu"},
    {TMS320C67X_INS_CMPLT, "cmplt"},
    {TMS320C67X_INS_CMPLTDP, "cmpltdp"},
    {TMS320C67X_INS_CMPLTSP, "cmpltsp"},
    {TMS320C67X_INS_CMPLTU, "cmpltu"},
    {TMS320C67X_INS_DPINT, "dpint"},
    {TMS320C67X_INS_DPSP, "dpsp"},
    {TMS320C67X_INS_DTRUNC, "dtrunc"},
    {TMS320C67X_INS_EXT, "ext"},
    {TMS320C67X_INS_EXTU, "extu"},
    {TMS320C67X_INS_INTDP, "intdp"},
    {TMS320C67X_INS_INTDPU, "intdpu"},
    {TMS320C67X_INS_INTSP, "intsp"},
    {TMS320C67X_INS_INTSPU, "intspu"},
    {TMS320C67X_INS_LDB, "ldb"},
    {TMS320C67X_INS_LDBU, "ldbu"},
    {TMS320C67X_INS_LDDW, "lddw"},
    {TMS320C67X_INS_LDH, "ldh"},
    {TMS320C67X_INS_LDHU, "ldhu"},
    {TMS320C67X_INS_LDW, "ldw"},
    {TMS320C67X_INS_LMBD, "lmbd"},
    {TMS320C67X_INS_MPY, "mpy"},
    {TMS320C67X_INS_MPYDP, "mpydp"},
    {TMS320C67X_INS_MPYH, "mpyh"},
    {TMS320C67X_INS_MPYHL, "mpyhl"},
    {TMS320C67X_INS_MPYHLU, "mpyhlu"},
    {TMS320C67X_INS_MPYHSLU, "mpyhslu"},
    {TMS320C67X_INS_MPYHSU, "mpyhsu"},
    {TMS320C67X_INS_MPYHU, "mpyhu"},
    {TMS320C67X_INS_MPYHULS, "mpyhuls"},
    {TMS320C67X_INS_MPYHUS, "mpyhus"},
    {TMS320C67X_INS_MPYI, "mpyi"},
    {TMS320C67X_INS_MPYID, "mpyid"},
    {TMS320C67X_INS_MPYLH, "mpylh"},
    {TMS320C67X_INS_MPYLHU, "mpylhu"},
    {TMS320C67X_INS_MPYLSHU, "mpylshu"},
    {TMS320C67X_INS_MPYLUHS, "mpyluhs"},
    {TMS320C67X_INS_MPYSP, "mpysp"},
    {TMS320C67X_INS_MPYSPDP, "mpyspdp"},
    {TMS320C67X_INS_MPYSP2DP, "mpysp2dp"},
    {TMS320C67X_INS_MPYSU, "mpysu"},
    {TMS320C67X_INS_MPYU, "mpyu"},
    {TMS320C67X_INS_MPYUS, "mpyus"},
    {TMS320C67X_INS_MVC, "mvc"},
    {TMS320C67X_INS_MVK, "mvk"},
    {TMS320C67X_INS_MVKH, "mvkh"},
    {TMS320C67X_INS_MVKL, "mvkl"},
    {TMS320C67X_INS_MVKLH, "mvklh"},
    {TMS320C67X_INS_NOP, "nop"},
    {TMS320C67X_INS_NORM, "norm"},
    {TMS320C67X_INS_OR, "or"},
    {TMS320C67X_INS_RCPDP, "rcpdp"},
    {TMS320C67X_INS_RCPSP, "rcpsp"},
    {TMS320C67X_INS_RSQRDP, "rsqrdp"},
    {TMS320C67X_INS_RSQRSP, "rsqrsp"},
    {TMS320C67X_INS_SADD, "sadd"},
    {TMS320C67X_INS_SAT, "sat"},
    {TMS320C67X_INS_SET, "set"},
    {TMS320C67X_INS_SHL, "shl"},
    {TMS320C67X_INS_SHR, "shr"},
    {TMS320C67X_INS_SHRU, "shru"},
    {TMS320C67X_INS_SMPY, "smpy"},
    {TMS320C67X_INS_SMPYH, "smpyh"},
    {TMS320C67X_INS_SMPYHL, "smpyhl"},
    {TMS320C67X_INS_SMPYLH, "smpylh"},
    {TMS320C67X_INS_SPDP, "spdp"},
    {TMS320C67X_INS_SPINT, "spint"},
    {TMS320C67X_INS_SPTRUNC, "sptrunc"},
    {TMS320C67X_INS_SSHL, "sshl"},
    {TMS320C67X_INS_SSUB, "ssub"},
    {TMS320C67X_INS_STB, "stb"},
    {TMS320C67X_INS_STH, "sth"},
    {TMS320C67X_INS_STW, "stw"},
    {TMS320C67X_INS_SUB, "sub"},
    {TMS320C67X_INS_SUB2, "sub2"},
    {TMS320C67X_INS_SUBAB, "subab"},
    {TMS320C67X_INS_SUBAH, "subah"},
    {TMS320C67X_INS_SUBAW, "subaw"},
    {TMS320C67X_INS_SUBC, "subc"},
    {TMS320C67X_INS_SUBDP, "subdp"},
    {TMS320C67X_INS_SUBSP, "subsp"},
    {TMS320C67X_INS_SUBU, "subu"},
    {TMS320C67X_INS_XOR, "xor"},
    {TMS320C67X_INS_IDLE, "idle"},
    {TMS320C67X_INS_MV, "mv"},
    {TMS320C67X_INS_NEG, "neg"},
    {TMS320C67X_INS_NOT, "not"},
    {TMS320C67X_INS_ZERO, "zero"},
};

#endif

const char *TMS320C67x_insn_name(csh handle, unsigned int id)
{
#ifndef CAPSTONE_DIET
	if (id >= TMS320C67X_INS_ENDING)
		return NULL;

	return insn_name_maps[id].name;
#else
	return NULL;
#endif
}

#ifndef CAPSTONE_DIET
static const name_map group_name_maps[] = {
	{ TMS320C67X_GRP_INVALID, NULL },
	{ TMS320C67X_GRP_FUNIT_D, "funit_d" },
	{ TMS320C67X_GRP_FUNIT_L, "funit_l" },
	{ TMS320C67X_GRP_FUNIT_M, "funit_m" },
	{ TMS320C67X_GRP_FUNIT_S, "funit_s" },
	{ TMS320C67X_GRP_FUNIT_NO, "funit_no" },
	{ TMS320C67X_GRP_JUMP, "jump" },
};
#endif

const char *TMS320C67x_group_name(csh handle, unsigned int id)
{
#ifndef CAPSTONE_DIET
	unsigned int i;

	if (id >= ARR_SIZE(group_name_maps))
		return NULL;

	for (i = 0; i < ARR_SIZE(group_name_maps); i++) {
		if (group_name_maps[i].id == id)
			return group_name_maps[i].name;
	}

	return group_name_maps[id].name;
#else
	return NULL;
#endif
}

tms320c67x_reg TMS320C67x_map_register(unsigned int r)
{
	static unsigned int map[] = { 0,
	};

	if (r < ARR_SIZE(map))
		return map[r];

	return 0;
}

#endif
